{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "BRC GIS &amp; IM",
	"language": "en",
	"home_page_url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/gis_im_weeknotes/",
	"feed_url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/feed/feed.json",
	"description": "Weeknotes from BRC GIS &amp; IM team",
	"author": {
		"name": "BRC GIS &amp; IM",
		"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/about"
	},
	"items": [
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-12-05/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-12-05/",
			"title": "IM in Nigeria programme, Chad StoryMap, trainings",
			"content_html": "<ul>\n<li>\n<p>We joined the information management sessions at the BRC's Nigeria programme quarterly meeting.</p>\n<ul>\n<li>IM focal points presented the impact of IM - this ranged from moving away from paper-based workflows, to training staff and volunteers in IM, supporting distributions, Excel trainings, the use of Kobo forms for Food Security and Livelihoods, WASH and Health programmes, and being able to respond more effectively (e.g. to provide IM support for the Mpox response).</li>\n</ul>\n</li>\n<li>\n<p>We supported colleagues in the Communications team to build a StoryMap to show the impact of a Red Cross livelihoods programme in Chad. One of the team has been helping the comms team build the StoryMap and another spent some time digitising river channels from satellite imagery. There are still a few small things to tweak but we're hoping the article will be published next week.</p>\n</li>\n<li>\n<p>More 2025 planning, this time with the IFRC Surge IM Working Groups</p>\n</li>\n<li>\n<p>We updated a map-based Excel dashboard so that a pivot chart and a map both update based on a single slicer. ArcGIS maps in Excel can use a pivot table as a data source for a map layer, but if the pivot table is filtered the change doesn't reflect on the map. The solution was to create a hidden non-pivot table copy of the contents of the pivot table and use that as the source for the map layer. It's a workaround, but it's good enough for now.</p>\n</li>\n<li>\n<p>We finished the first version of a geospatial support tool (based on the ESRI Atlas instant app template) and shared it with operational teams. The tool allows users to easily change basemaps, add layers from a pre-selected list (focused on severe weather, operational assets and social vulnerability), and make sketches or measurements on the map canvas.</p>\n</li>\n<li>\n<p>We're half way through a GIS training for National Societies in the MENA region, working with IFRC, German Red Cross, Netherlands Red Cross and HeiGIT. We've also been preparing to run a training on the role of SIMS Remote Coordinator with the American Red Cross.</p>\n</li>\n</ul>\n",
			"date_published": "2024-12-05T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-28/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-28/",
			"title": "Lunch, globes, 2025 planning and MENA training",
			"content_html": "<ul>\n<li>\n<p>We had a combined team day and Christmas lunch. We used the morning to review 2024 and look ahead to 2025 and identified some topics to do some more detailed planning on in January. And then had a Christmas lunch, joined by one of our IM Register members who happened to be in town for a few days.</p>\n</li>\n<li>\n<p>We held the first two sessions of a three-week GIS training for colleagues from National Societies in the Middle East region. The content is being taught from the <a href=\"https://giscience.github.io/gis-training-resource-center/\">IFRC GIS training platform</a>, and will let us test the content and format some more.</p>\n</li>\n<li>\n<p>Some of the team went to the Royal Geographic Society's Monday night lecture about the art of <a href=\"https://www.rgs.org/events/upcoming-events/the-art-of-globemaking-inside-the-hidden-world-of-an-ancient-craft\">globe-making</a>.</p>\n</li>\n<li>\n<p>We did another interview with a user of one of our most-used web apps, to better understand how it's being used and any pain points with the current setup. We'll soon have to rebuild the tool in ESRI's Experience Builder when it <a href=\"https://doc.arcgis.com/en/web-appbuilder/latest/create-apps/wab-retirement.htm\">replaces</a> Web App Builder and want to understand how we can improve it before starting the work.</p>\n</li>\n<li>\n<p>We spoke to colleagues working in Health Information Management about their upcoming work, and had a good introduction to BRC's new Senior Disaster Risk Reduction and Climate Resilience adviser. We shared some information about what our team does, particularly around support for Enhanced Vulnerability and Capacity Assessments.</p>\n</li>\n<li>\n<p>We continued planning for the Humanitarian Information Analysis training to be held in Abuja in early 2025, and separately joined a planning session for Nigerian Red Cross' IM activities for 2025.</p>\n</li>\n<li>\n<p>We had a meeting with colleagues working on a mapping tool in PowerBI to understand the project better and answer their technical questions about ArcGIS Online. (The tool uses ArcGIS as a data source.)</p>\n</li>\n</ul>\n",
			"date_published": "2024-11-28T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-21/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-21/",
			"title": "Demoing maps, figuring out licenses, dynamic data attachments",
			"content_html": "<h2 id=\"published-new-maps\" tabindex=\"-1\">Published new maps <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-21/\">#</a></h2>\n<p>We published the security map we've been working on for a while. The tool shows the locations of deployed staff, alongside data from Insecurity Insight and IFRC security ratings. The map was built in ArcGIS Experience Builder and has a companion Experience that allows security team staff to update some of the data sources through a form interface.</p>\n<p>We also updated some layers on a prototype Emergency Response map we're working on: creating view layers for flooding, weather, traffic, and internal data that abstract some of the detail; and drafting explanatory metadata so the layers can be used in a self-service way more easily.</p>\n<p>A map of case studies we made with the Community Engagement and Accountability Hub was published on their website. This was also made with Experience Builder and involved some trade-offs between the brief from the team and what's possible in Experience Builder. Some technical details we couldn't iron out, but hopefully we can come back to them as Experience Builder matures.</p>\n<h2 id=\"demos-of-mapping-tools\" tabindex=\"-1\">Demos of mapping tools <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-21/\">#</a></h2>\n<p>We demoed our Crisis Response mapping product to a colleague to check that it doesn't duplicate functionality being built into a new tool by a different team. The outcome was that we all have a better understanding of what each tool does, and we're happy that the two tools do different things.</p>\n<p>We held the final Python User Group session of 2024 and did a demo of some tools our team has built using Streamlit, such as a postcode geocoding tool (<a href=\"https://postcodelookupapp-yaadvzhrseyhsdhbssw8qh.streamlit.app/\">Streamlit app</a>, <a href=\"https://github.com/ioalexei/postcode_lookup_streamlit\">GitHub repo</a>), a tool to work with deployment data, and a tool to help understand catchment areas for event venues (<a href=\"https://event-venue-catchment-area-hvjr4scwvaiigvuygshpxt.streamlit.app/\">Streamlit app</a>, <a href=\"https://github.com/britishredcrosssociety/event-venue-catchment-area\">GitHub repo</a>).</p>\n<h2 id=\"licenses\" tabindex=\"-1\">Licenses <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-21/\">#</a></h2>\n<p>We had conversations about the best way to get ESRI licenses for more people in the organisation (that is, how do we fund licenses beyond what's included in our annual subscription). There is growing demand for people to access and edit internal data, which requires licenses - so we're talking to potential users and budget holders to try to find a solution that works for everyone.</p>\n<h2 id=\"dynamic-data-attachments\" tabindex=\"-1\">Dynamic data attachments <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-21/\">#</a></h2>\n<p>We spent some time figuring out how to use <a href=\"https://support.kobotoolbox.org/dynamic_data_attachment.html\">dynamic data attachments</a> in <a href=\"https://www.kobotoolbox.org/\">KoboToolbox</a>, with the aim of helping colleagues in one of our partner National Societies use this feature to track indicators across several rounds of household assessments. In theory, this should allow surveyors to pull existing data from previous assessments so they don't need to repeat questions unnecessarily, leading to quicker surveys and less chance for error.</p>\n<p>We found that when allowing dynamic data attachments in the Kobo interface, you are given a warning that this could expose all data saved in the project. After digging deeper, it seems that only the specific fields chosen by the admin get exposed, which is much less of a risk for data protection since sensitive data can be kept hidden.</p>\n",
			"date_published": "2024-11-21T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/",
			"title": "Trainings, incident response simulation, FOSS4G UK + more",
			"content_html": "<p>Two week's worth of updates, since we missed last week.</p>\n<h2 id=\"emergency-response-simulation\" tabindex=\"-1\">Emergency Response simulation <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>One of us travelled to Scotland to join an incident response simulation run by the\nScotland Emergency Response team. We made maps on the fly in response to the scenario\nand the needs of the other participants.</p>\n<p>Off the back of this, we started a prototype map template app so Emergency Response\nteams have a self-service tool to create a printable map with custom layers visible\nfor when they are called to an incident.</p>\n<h2 id=\"designer-led-review-of-web-app\" tabindex=\"-1\">Designer-led review of web app <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>One of the team joined a review session for users of a web app we maintain,\nfacilitated by a colleague from the Service Design team. The users did a walkthrough\nof how they use the app, which generated a lot of useful feedback.</p>\n<p>This has led to us starting a prototype of an improved tool with additional\ndata sources that can provide context (such as traffic, flooding, weather),\nimproved styling for existing laters, and removing unnecessary/confusing elements\nfor greater clarity.</p>\n<h2 id=\"trainings\" tabindex=\"-1\">Trainings <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>One of the team completed the IFRC's IMPACT training (a rather clumsy acronym for\n&quot;International Mobilization and Preparation for Action&quot;). The course is designed to\nprepared staff for working in an international context with colleagues from other\nNational Societies and ICRC.</p>\n<p>We also had a kick-off meeting to prepare for running a Humanitarian Information\nAnalysis Course in Abuja, to run in March 2025.</p>\n<p>More info on both trainings in the <a href=\"https://surgelearning.ifrc.org/resources/catalog-emergency-trainings\">IFRC Surge Training Catalogue</a>.</p>\n<h2 id=\"security-map\" tabindex=\"-1\">Security map <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>We continue working on a webmap for the BRC Security Unit, bringing together relevant\ndata from different sources. The goal is to support the understanding of risk in\ndifferent countries.</p>\n<h2 id=\"troubleshooting-overseas-british-territories-on-ifrc-go\" tabindex=\"-1\">Troubleshooting Overseas British Territories on IFRC GO <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>We looked into an issue for colleagues wanting to submit reports on British Overseas\nTerritories to the IFRC GO platform. OSBs aren't currently represented as separate\nentities on GO, so have no way to submit reports. (One of the endless complications in\nbuilding a model that copes with the many and varied forms of soveriegnty). We've flagged\nwith the GO team to investigate further.</p>\n<h2 id=\"geocall-kenya-red-cross\" tabindex=\"-1\">GeoCall: Kenya Red Cross <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>On the latest Red Cross/Red Crescent Geo call we had an excellent presentation from\na colleague at the Kenyan Red Cross on using GIS for flood risk management.\nThey presented on community mapping in OpenStreetMap to model flood risk,\nand mapping flood impacts using optical and radar imagery together with field data collection.</p>\n<h2 id=\"foss4g-uk\" tabindex=\"-1\">FOSS4G UK <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>One of the team went to the <a href=\"https://uk.osgeo.org/foss4guk2024/bristol.html\">FOSS4G UK event</a> in Bristol.\nThere were a wide range of presentations on using open source geospatial software\nto solve problems in different domains, from mapping ancient woodland to monitoring shipping.</p>\n<p>Two of the most interesting from a technical point of view were a look at the Overture Maps\ndatasets (<a href=\"https://uk.osgeo.org/foss4guk2024/decks/11-al-graham-overture.pdf\">PDF</a>)\nand using DuckDB to load geospatial data.</p>\n<h2 id=\"maps-in-excel\" tabindex=\"-1\">Maps in Excel <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-11-14/\">#</a></h2>\n<p>In recent weeks at our drop-in sessions we've had a lot of discussion of using ArcGIS in Excel\nwhich has led us to explore what's possible or not for different types of users.</p>\n<p>Recent observations include:</p>\n<ul>\n<li>It's not possible to change locations of labels</li>\n<li>printing maps from Excel is no longer possible (a workaround is to load the\ndocument in Excel Online and use the “expand map to fullscreen” button, then take\na screenshot of that)</li>\n<li>Showing users how to add boundary data published by the Office for National Statitics from the ESRI Living Atlas</li>\n<li>Custom boundary datasets need to be created by a user with an ArcGIS account,\nbut can then be accessed by other users who don't have a license.</li>\n</ul>\n",
			"date_published": "2024-11-14T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-31/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-31/",
			"title": "Geographic lookups, API access to security information, ArcGIS Hub Premium and Drones",
			"content_html": "<h2 id=\"geo-lookups\" tabindex=\"-1\">Geo Lookups <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-31/\">#</a></h2>\n<p>We had early discussions with colleagues about how to make better use of geographic lookups for signposting to relevant services. What started as a conversation about how to update data on a webmap expanded into how services covering different geographies could be easily looked up for a given client location. We talked a bit about possible query interfaces beyond a simple map, and the maintenance burden of building a more complex data structure that might support detailed queries. There’s no work planned on this for now, but there was a lot of interest in the possibilities.</p>\n<h2 id=\"api-access-to-security-information-that-affects-ngos\" tabindex=\"-1\">API access to Security Information that affects NGOs <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-31/\">#</a></h2>\n<p>We’ve been in discussions with <a href=\"https://insecurityinsight.org/\">Insecurity Insight</a>, an organisation that examines threats facing people living and working in dangerous environments, with datasets that include aid workers who were killed, injured, kidnapped, or arrested. Their data is currently published on <a href=\"https://data.humdata.org/organization/insecurity-insight\">HDX</a>. This data is used within British Red Cross to inform security for our staff. We are working with them to get API access to the dataset, to enable updates which can feed directly into info products.</p>\n<h2 id=\"arcgis-hub-premium\" tabindex=\"-1\">ArcGIS Hub Premium <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-31/\">#</a></h2>\n<p>We have activated an instance of ArcGIS Hub Premium as part of our ArcGIS license. We’re aiming to test out the functionality and see how useful/applicable it might be to support our domestic Crisis and Emergency Response services. We’ve seen examples of other charities using Hub Premium to engage with their volunteer capacity, without needing to grant full access to ArcGIS Online. We are looking to see if this is replicable to the British Red Cross context and way of working.</p>\n<h2 id=\"ifrc-drones-working-group\" tabindex=\"-1\">IFRC Drones Working Group <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-31/\">#</a></h2>\n<p>The IFRC with Red Cross and Red Cresent National Societies run a number of working groups focusing on different topics – one being drones. This week the German Red Cross presented about their National UAV capacity that includes over 450 trained people in their branches across Germany, and how they support their emergency services.</p>\n",
			"date_published": "2024-10-31T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/",
			"title": "Upcoming trainings, Azure Maps API, GIS in Eswatini, and Nigerian RC event with YouthMappers",
			"content_html": "<h2 id=\"trainings\" tabindex=\"-1\">Trainings <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/\">#</a></h2>\n<p>We have a couple of trainings before the end of the year that we are supporting.</p>\n<h3 id=\"sims-coordinator-training\" tabindex=\"-1\">SIMS Coordinator Training <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/\">#</a></h3>\n<p><a href=\"https://rcrcsims.org/\">Surge Information Management Support (SIMS)</a> is a global network of Information Management specialists who support IFRC emergency response operations by providing a variety of services and products. Key areas of technical support include geospatial analysis, web-based and static data visualization, mobile data collection, scenario planning, and more. SIMS remote coordinators work directly with teams in-country to translate operational needs into discrete tasks, which are then assigned to specialists with the skills and experience to complete them.\nThis SIMS Remote Coordinator Training is a remote, scenario-based training where participants work through the phases of remote coordination and associated information products.</p>\n<p>We are supporting by planning this training and being a facilitator.</p>\n<h3 id=\"gis-training-mena-region\" tabindex=\"-1\">GIS Training (MENA Region) <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/\">#</a></h3>\n<p>This remote training equips participants to use GIS at basic and intermediate levels; to enhance the skills of participants in spatial data analysis and visualization; and to enable participants to apply GIS in their disaster management and response activities.</p>\n<p>This training is hosted for MENA participants and aims to build the capacity of Red Cross and Red Crescent National Societies in the region.</p>\n<p>This training was developed as GIS knowledge applied to humanitarian programmes or emergencies is limited within RCRC, which are linked to the surge competency framework.</p>\n<h2 id=\"azure-maps-api\" tabindex=\"-1\">Azure Maps API <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/\">#</a></h2>\n<p>We’ve been testing the feasibility of enabling frontline operations teams to geocode their own data and map it automatically. These teams handle address data daily in their work and currently do not have a way to map this data themselves consistently/automatically without manually using multiple tools. We have tested Bing Maps API and ArcGIS Geocoding service to do this in Power Automate. We are looking to test in Azure for comparative purposes.</p>\n<h2 id=\"eswatini-longer-term-gis-plans\" tabindex=\"-1\">Eswatini longer term GIS plans <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/\">#</a></h2>\n<p>British Red Cross support the Baphalali Eswatini Red Cross Society. The National Society have expressed interest in enhancing their GIS and Information Management capacity in the longer term. We are putting together a document to start a conversation about how this could work, by outlining several scenarios, from one-off support, integrating within a programme, or building the data readiness of the National Society. This document should also be reusable for other countries.</p>\n<h2 id=\"nigeria-peer-learning-event\" tabindex=\"-1\">Nigeria Peer Learning Event <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-24/\">#</a></h2>\n<p>As part of the Nigerian Red Cross supported Disaster Management Programme, there is opportunity for a Peer Learning Event. Nigerian Red Cross are currently planning this with YouthMappers. The focus of this will be around the use of Information Management and GIS for developments and disaster management.</p>\n",
			"date_published": "2024-10-24T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/",
			"title": "Generalisation, geocoding, web tools, team day",
			"content_html": "<h2 id=\"data-generalisation-explainer\" tabindex=\"-1\">Data generalisation explainer <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/\">#</a></h2>\n<p>We <a href=\"https://medium.com/digital-and-innovation-at-british-red-cross/generally-speaking-1647906d8edb\">published an article</a>\nexplaining the different levels of generalisation in ONS geospatial products.\nIt's come up a few times in recent conversations, making it a good canidadate\nfor an article!</p>\n<h2 id=\"geocoding-with-bing-maps-api\" tabindex=\"-1\">Geocoding with Bing Maps API <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/\">#</a></h2>\n<p>Following on from <a href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/\">Maps in Sharepoint</a>,\nwe did some testing and documentation of geocoding addresses in a Sharepoint list\nusing Power Automate and the <a href=\"https://learn.microsoft.com/en-us/bingmaps/getting-started/#developer-apis\">Bing Maps API</a>\n(soon to become Azure Maps API). Write-up to follow once we've tested and documented some other options.</p>\n<h2 id=\"triggering-python-notebooks-from-arcgis-webapps\" tabindex=\"-1\">Triggering Python notebooks from ArcGIS webapps <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/\">#</a></h2>\n<p>We spent some time looking into using <a href=\"https://www.esri.com/arcgis-blog/products/arcgis-online/announcements/notebooks-as-web-tools-in-arcgis-online/\">ESRI Web Tools to trigger a Python scripts</a> in an ESRI Notebook to run custom analysis on the fly.\nWe got a demo working, but found that while the Python script ran well from a\nhosted Jupyter Notebook, running it as a web tool from a webmap was significantly\nslower, possibly because it is initiating a notebook server before it can run the script.\nWe'll look into why it's so much slower and if there's a way to optimise it.</p>\n<h2 id=\"python-user-group\" tabindex=\"-1\">Python User Group <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/\">#</a></h2>\n<p>Our team hosts a monthly (more or less) BRC Python User Group for people working\nwith Python across different teams. This month we had a great presentation on\nhow a colleague from the Retail team is using Python for reporting and\nanalysis.</p>\n<h2 id=\"planning-support-for-gis-programmes-with-international-partners\" tabindex=\"-1\">Planning support for GIS programmes with international partners <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/\">#</a></h2>\n<p>We had a good discussion with a partner National Society on their plans for\nincluding GIS activities in their 2025 planning. We'll draw up some options to\ngive them an idea of the sorts of activities we can support with, to inform their planning.</p>\n<h2 id=\"team-away-day\" tabindex=\"-1\">Team away day <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-17/\">#</a></h2>\n<p>And finally, we ended the week with a team day in London, meeting up with other\nteams that also sit under Transformation and Change. We spoke a bit about how\nthe wider teams work together, some context around BRC strategy, and\nheard from colleagues in the London Refugee Support team about their work.</p>\n",
			"date_published": "2024-10-17T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-10/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-10/",
			"title": "Sharing spatial data and apps, UK boundaries and generalisation, Canadian Red Cross presentation, and security maps",
			"content_html": "<h2 id=\"sharing-spatial-data-and-apps-arcgis-hub-premium\" tabindex=\"-1\">Sharing Spatial Data and Apps: ArcGIS Hub Premium <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-10/\">#</a></h2>\n<p>As part of a team goal to enable users to create their own geographic products, we have an internal ArcGIS Hub site that allows users to search, view, download and use geographic data that we hold, and various geo apps.</p>\n<p>We already have an ArcGIS Hub Basic site, however by upgrading this to Premium it also allows other stakeholders and community members to also join – that may not be part of the Red Cross – which can be useful for emergency response and collaboration.</p>\n<p>We are going to start to focus on creating a Premium site to be ready for testing.</p>\n<h2 id=\"uk-boundaries-and-data-generalisation\" tabindex=\"-1\">UK Boundaries and Data Generalisation <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-10/\">#</a></h2>\n<p>We started to write a blog detailing the <a href=\"https://www.ons.gov.uk/methodology/geography/geographicalproducts/digitalboundaries\">different generalisation levels</a> of UK boundary datasets provided by the Office for National Statistics (ONS). We get asked questions about the difference between them and which one to use (e.g., for a webmap, geospatial analysis, in PowerBI). This will hopefully be a good resource to send people to help explain and refer back to.</p>\n<h2 id=\"red-cross-red-cresent-geocall-canadian-red-cross-geo-eligibility\" tabindex=\"-1\">Red Cross Red Cresent GeoCall: Canadian Red Cross Geo-Eligibility <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-10/\">#</a></h2>\n<p>The Canadian Red Cross presented how they use GIS within a domestic response, and specifically their “geo-eligibility” tool. Eligible people to receive assistance are those that are within the geographic boundary of an impacted area, such as a wildfire evacuation zone, or flood area. This information is then used to provide financial assistance via e-banking. An example of the recent Jasper wildfire was used.</p>\n<h2 id=\"security-map\" tabindex=\"-1\">Security Map <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-10/\">#</a></h2>\n<p>Our international department have a security unit that look after British Red Cross staff safety and security. We’ve recently started a project with them to create an ArcGIS Experience, where they are able to edit the security situation and level within a country. This information then is changed on a webmap visible by a wider audience. This week we’ve been adding more countries to this tool which will then be user tested.</p>\n",
			"date_published": "2024-10-10T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/",
			"title": "Missing Maps job, maps in Excel and Sharepoint, drones surge, maps guidance",
			"content_html": "<h2 id=\"missing-maps-job\" tabindex=\"-1\">Missing Maps job <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/\">#</a></h2>\n<p>The job that the team was consulted on the job description for is now live:</p>\n<ul>\n<li><a href=\"https://careers.redcross.org.uk/vacancies/10471/workshop-facilitator--missing-maps.html\">Missing Maps Workshop facilitator</a>\n<ul>\n<li>Location: UK flexible</li>\n<li>Pay: £350-400 day rate</li>\n<li>Contract type: Self-employed</li>\n<li>Closing date: 16 October 2024</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"maps-in-excel\" tabindex=\"-1\">Maps in Excel <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/\">#</a></h2>\n<p>We looked a bit deeper into the possibilities for using ArcGIS Online maps in Excel and Sharepoint.</p>\n<p>For Excel, we looked at what's possible using the ArcGIS Excel plugin as an unlicensed user. We discovered that users without a license assigned can:</p>\n<ul>\n<li>Only add one public featurelayer at a time from ArcGIS Online to a map in Excel</li>\n<li>Add one public webmap to a map in Excel, which can contain multiple layers that someone else has made</li>\n</ul>\n<p>If an unlicensed user adds a public webmap, the feature layers from that map are added to the Excel map as individual layers. If the user then adds another featurelayer to the map, the layers from the public webmap are removed.</p>\n<p>We'll continue looking into what the capabilities are for licensed vs unlicensed users, as it helps us understand what's the best way to support people according to their specific needs.</p>\n<h2 id=\"maps-in-sharepoint\" tabindex=\"-1\">Maps in Sharepoint <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/\">#</a></h2>\n<p>We looked again at options for creating maps from Sharepoint lists. In particular, for geocoding data from a Sharepoint list using PowerAutomate and feeding that into a map on ArcGIS Online. We've prototyped a workflow that takes address data from a sharepoint list and processes it so it will show up in an ArcGIS map component on a Sharepoint site.</p>\n<p>The basic workflow is:</p>\n<ul>\n<li>Add the address as an address data type in a Sharepoint list</li>\n<li>This automatically geocodes to a lat/long coordinate pair in the background</li>\n<li>Use PowerAutomate to split the coordinates into explicit <code>Lat</code> and <code>Long</code> columns</li>\n<li>Use these columns to provide the location for visualisation on the ArcGIS map component for Sharepoint</li>\n</ul>\n<h2 id=\"drones-surge\" tabindex=\"-1\">Drones surge <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/\">#</a></h2>\n<p>We contributed to a IFRC Surge Awareness seminar on the use of drones/UAVs for emergency response. Drone teams are now available to request as part of the IFRC surge catalogue, with teams available to deploy from American and Italian Red Cross. The services currently offered are:</p>\n<ul>\n<li>Media and comms</li>\n<li>Situational awareness</li>\n<li>Mapping</li>\n<li>Site surveys\nIt's likely that the services offered will expand in the future as more National Societies set up teams capable of offering surge support.\nThe presentation (prepared by American Red Cross) covered how the surge mechanism works for drone teams, explained the benefits of using drones for emergency response, and gave a brief overview of how drone mapping works.</li>\n</ul>\n<p>The other version of this call, presented by American Red Cross, is available on the <a href=\"https://www.youtube.com/watch?v=sFKWu7CRgqk\">IFRC Drones Group YouTube channel</a>.</p>\n<h2 id=\"maps-guidance-document\" tabindex=\"-1\">Maps guidance document <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-10-03/\">#</a></h2>\n<p>We started work on a document on the use of maps as a guide to other teams. It will include things to consider for people making or commissioning maps, such as use of suitable colours, our approved datasets for international boundaries, how to show disputed boundaries, etc.</p>\n",
			"date_published": "2024-10-03T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-26/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-26/",
			"title": "Nigeria IM, drones case studies, conversations",
			"content_html": "<p>Having started writing up team weeknotes last week, on this week's agenda was\nfiguring out a good way to share them. I settled on using <a href=\"https://11ty.dev\">11ty</a> to build the site and GitHub pages for sharing.</p>\n<h2 id=\"planning-humanitarian-information-analysis-training\" tabindex=\"-1\">Planning Humanitarian Information Analysis training <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-26/\">#</a></h2>\n<p>As part of our ongoing programme of support and capacity building around\ninformation management with Nigerian Red Cross, last week we made progress\non plans to hold a Humanitarian Information Analysis Course training in Abuja early in 2025.</p>\n<p>HIAC is designed to help people &quot;make sense of available information in\nhumanitarian emergencies&quot;, providing a structural framework to gather and\ninterpret primary and secondary data. The training helps people make sense of the large variety of information sources they will encounter responding to emergencies, triangulate between data sources to improve accuracy, and identify missing data.</p>\n<p>Some more info on HIAC is in IFRC's <a href=\"https://surgelearning.ifrc.org/resources/catalog-emergency-trainings\">Catalogue of Emergency Trainings</a> (PDF).</p>\n<p>We also had some discussions on 2025 planning with colleagues at Nigerian Red\nCross about some options for the work they're doing to <a href=\"https://medium.com/digital-and-innovation-at-british-red-cross/branch-level-experiences-in-growing-information-management-at-nigerian-red-cross-56f587abddf2\">develop NRC's IM\ncapacity</a>. We'll share more when the plans are more concrete.</p>\n<h2 id=\"drones-case-studies-website\" tabindex=\"-1\">Drones case studies website <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-26/\">#</a></h2>\n<p>Some of our team are supporting the <a href=\"https://drones.preparecenter.org/\">IFRC Drones Working Group</a> to develop a\ncase study resource, where people can look up the details of how drones are\nbeing used in the Red Cross Movement. The work is complementary to American Red Cross's 2020 report <a href=\"https://americanredcross.github.io/rcrc-drones/\">Aid From The Air: An overview of drone use in the RCRC global network</a>.</p>\n<p>We've already done some work identifying possible case studies (researching which references from the report have enough detail to be useful as standalone case studies). This week, we worked on a minisite, also based on 11ty - taking advantage of 11ty's ability to <a href=\"https://florian.ec/blog/eleventy-data-pages/\">create pages from structured data</a>. An initial test worked well, so we'll now focus on cleaning up the styling and building out the structure data for the case studies to draw on.</p>\n<p>Hopefully the case studies can provide a structure for documenting future activities in a way that's easy to share with others/learn from.</p>\n<h2 id=\"conversations-with-colleagues\" tabindex=\"-1\">Conversations with colleagues <a class=\"header-anchor\" href=\"https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-26/\">#</a></h2>\n<p>In our <a href=\"https://medium.com/digital-and-innovation-at-british-red-cross/looking-back-on-150-gis-im-hours-8ef07589fba1\">drop-in session</a> this week, we discussed:</p>\n<ul>\n<li>Making maps from ArcGIS Online data in Excel</li>\n<li>Using PowerQuery to consolidate data from multiple Excel documents</li>\n<li>A broad look at creating a single source of truth for information in emergencies. We spoke a bit about the IFRC's approach and the recent use of the Data Entry &amp; Exploration Platform (<a href=\"https://thedeep.io/\">DEEP</a>) in the response to Hurricane Beryl in the Caribbean.</li>\n</ul>\n<p>This week we had useful conversations with colleagues in our Insight and Crisis Response teams about options for updating a layer on ArcGIS Online using Python scripts. It's something our team has been working with for a while and opens up a lot of options for moving beyond manual updates, which limit the number and frequency of updates you can manage.</p>\n<p>We also had a chat to people from the Innovation team about mapping options for\npossible work around supporting people affected by floods, and provided\nfeedback on a job description for another team that overlaps with some of our\nwork.</p>\n",
			"date_published": "2024-09-26T00:00:00Z"
		}
		,
		{
			"id": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-19/",
			"url": "https://britishredcrosssociety.github.io/gis_im_weeknotes/blog/2024-09-19/",
			"title": "Office day, training plans, drop-in debriefs",
			"content_html": "<p>We started this week with a team day in the office. In the morning, we were joined by a\ncolleague from the IFRC GIS team who gave us an update on what he's been working on,\nincluding local unit mapping.</p>\n<p>In the afternoon, we did some team planning, sketching out what we've committed to up\nuntil Christmas. This included:</p>\n<ul>\n<li>Runnning an online GIS training for colleagues in the MENA, with German Red Cross, Netherlands Red Cross, IFRC and HeiGIT</li>\n<li>Running an online SIMS Coordinator training with American Red Cross</li>\n<li>Arranging a Humanitarian Information Analysis training in Abuja with Nigeria Red Cross</li>\n<li>Joining a simulation exercise run by BRC Emergency Response teams in Scotland</li>\n<li>Testing features in ArcGIS Online that we don't currently use, like Hub Premium and ArcGIS Web Tools</li>\n</ul>\n<p>Some of the team went to the <a href=\"https://thegeomob.com/post/sept-18th-2024-geomoblon-details\">Geomob</a>\nevent in London, where Pete Masters was presenting about Humanitarian OpenStreetMap Team's work\nmapping slums and other speakers celebrated OSM's 20-year anniversary.</p>\n<p>Behind the scenes, we renewed BRC's subscription to ArcGIS Online and updated the single-sign\non settings that allow BRC staff to use AGOL through Microsoft's MyApps service without needing\na separate ESRI login.</p>\n",
			"date_published": "2024-09-19T00:00:00Z"
		}
		
	]
}
